# Resolution Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ImageType..::..Resolution Property
ImageType Class See Also
---
The size of the pixels in the image, expressed in dots-per-inch (dpi)
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public double Resolution { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Resolution As Double
	Get
```

Visual C++
---
```text
public:
property double Resolution {
	double get ();
}
```

# See Also
ImageType Class
Autodesk.Revit.DB Namespace